In [1]:
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
get_ipython().magic(u'matplotlib inline')
sns.set_style('whitegrid')
import warnings
warnings.filterwarnings('ignore')

In [2]:
import numpy as np

- [1.语法示例](#1)
    - [1.1图片](#1.1)

#http://www.codedata.com.tw/database/mysql-tutorial-basic-query

pip install mysqlclient

import MySQLdb


    mydb = MySQLdb.connect(host='localhost',
        user='root',
        passwd='',
        db='mydb')
    cursor = mydb.cursor()

<h3 id="1">1.语法示例</h3>

In [7]:
'''
# open a database connection
# be sure to change the host IP address, username, password and database name to match your own
connection = MySQLdb.connect (host = "192.168.1.2", user = "user", passwd = "password, db = "scripting_mysql")

# prepare a cursor object using cursor() method
cursor = connection.cursor ()

# execute the SQL query using execute() method.
cursor.execute ("select name_first, name_last from address")

# fetch all of the rows from the query
data = cursor.fetchall ()

# close the cursor object
cursor.close ()

# close the connection
connection.close ()
'''

'\n# open a database connection\n# be sure to change the host IP address, username, password and database name to match your own\nconnection = MySQLdb.connect (host = "192.168.1.2", user = "user", passwd = "password, db = "scripting_mysql")\n\n# prepare a cursor object using cursor() method\ncursor = connection.cursor ()\n\n# execute the SQL query using execute() method.\ncursor.execute ("select name_first, name_last from address")\n\n# fetch all of the rows from the query\ndata = cursor.fetchall ()\n\n# close the cursor object\ncursor.close ()\n\n# close the connection\nconnection.close ()\n'

<h3 id="1.1">1.1图片</h3>

![pic](2018-10-30_222119.png)

![pic](1.png)

In [3]:
data = pd.read_csv('result資料.csv')

In [4]:
data['ymd'] = pd.to_datetime(data['ymd'])

In [5]:
data['first_ymd'] = data.groupby('billing_email')['ymd'].transform('min')

In [6]:
before_2 = data.query('ymd <= "2016-02-28"')
before_3 = data.query('ymd <= "2016-03-31"')
before_4 = data.query('ymd <= "2016-04-30"')
before_5 = data.query('ymd <= "2016-05-31"')
before_6 = data.query('ymd <= "2016-06-30"')

In [31]:
before_6.head()

,Unnamed: 0,billing_address_1,billing_email,billing_last_name,billing_phone,billing_postcode,cart_discount,coupons,customer_id,date,...,month,weekofyear,dayofweek,ymd,time,category,merchant,first_ymd,new,ym
0,0,新莊區中正路887之17號4樓,ines88717@gmail.com,陳美玲,912419758,242,0,NaN,0,2015-06-30 22:29:35,...,6,27,1,2015-06-30,22:29:35,1211.0,111.0,2015-03-10,old,2015-06
1,1,新莊區中正路887之17號4樓,ines88717@gmail.com,陳美玲,912419758,242,0,NaN,0,2015-06-30 22:29:35,...,6,27,1,2015-06-30,22:29:35,1211.0,211.0,2015-03-10,old,2015-06
2,2,台北市中正區羅斯福路一段6號12樓,16659@ms.bli.gov.tw,林宛蓁,963144582,100,0,NaN,1498,2015-06-30 19:10:37,...,6,27,1,2015-06-30,19:10:37,52.0,201506001.0,2015-06-30,new,2015-06
3,3,礁溪鄉中山路一段190號5樓,karen1125jam@gmail.com,詹青蓉,922681258,262,0,NaN,158,2015-06-30 10:47:24,...,6,27,1,2015-06-30,10:47:24,1212.0,411.0,2015-03-06,old,2015-06
4,4,新北市三重區進安街38號7樓,ace0416@gmail.com,蔡勳忠,920900382,241,0,NaN,1020,2015-06-30 09:46:19,...,6,27,1,2015-06-30,09:46:19,1211.0,211.0,2015-02-26,old,2015-06

In [13]:
before_6['new'] = 'old'
before_6['new'][before_6['ymd'] == before_6['first_ymd']] = 'new'

In [30]:
before_6['ym'] = before_6['ymd'].astype(str).str[:7]

In [71]:
temp = before_6.drop_duplicates(subset=['billing_email','ymd'])
new_old_n = temp.groupby(['new','ym'])['billing_email'].count().reset_index()

In [72]:
new_old_m = before_6.groupby(['new','ym'])['order_total'].sum().reset_index()

In [73]:
new_old_average = before_6.groupby(['new','ym'])['order_total'].mean().reset_index()
new_old_average = new_old_average.rename(columns = {'order_total':'average_order_money'})

In [74]:
new_old_merge = new_old_n.merge(new_old_m, on=['new','ym'], how='inner')

In [75]:
new_old_merge = new_old_merge.merge(new_old_average, on=['new','ym'], how='inner')

In [77]:
new_old_merge.to_csv('new_old.csv')

In [76]:
new_old_merge

    new       ym  billing_email  order_total  average_order_money
0   new  2015-01            140       295059          1130.494253
1   new  2015-02            109       281412          1359.478261
2   new  2015-03            144       366061          1365.899254
3   new  2015-04            148       328350          1225.186567
4   new  2015-05            218       534372          1377.247423
5   new  2015-06            105       228708          1284.876404
6   new  2015-07            117       214236          1133.523810
7   new  2015-08            154       400651          1376.807560
8   new  2015-09            299      1358008          2029.907324
9   new  2015-10            170       364051          1189.709150
10  new  2015-11            773      1253455          1245.979125
11  new  2015-12           1077      2953457          1745.541962
12  new  2016-01            453      1067702          1363.604087
13  new  2016-02           1326      3056625          1489.583333
14  new  2016-03           1539      4239971          1289.528893
15  new  2016-04           1087      2626994          1531.774927
16  new  2016-05           1155      3476941          1711.093012
17  new  2016-06           1027      2247328          1261.834924
18  old  2015-01             19        48851           775.412698
19  old  2015-02             47       119828          1198.280000
20  old  2015-03             85       175687           987.005618
21  old  2015-04             71       173622          1105.872611
22  old  2015-05            128       312016          1130.492754
23  old  2015-06            111       207898           862.647303
24  old  2015-07             76       144937          1081.619403
25  old  2015-08             82       219620          1494.013605
26  old  2015-09            137       565099          1686.862687
27  old  2015-10            109       298563          1199.048193
28  old  2015-11            234       531507          1376.961140
29  old  2015-12            504      1886959          2046.593275
30  old  2016-01            297       900200          1468.515498
31  old  2016-02            576      1459251          1498.204312
32  old  2016-03            695      2453507          1328.374120
33  old  2016-04            735      3045080          2084.243669
34  old  2016-05            933      4005083          2080.562597
35  old  2016-06            701      2184088          1482.748133

In [7]:
def GetRFM(data):
    nowday = pd.to_datetime(data['ymd'].max())

    data['lastdate'] = pd.to_datetime(data.groupby('billing_email')['ymd'].transform('max'))

    data['R'] = nowday - data['lastdate']
    data['R'] = data['R'].astype('str').str.split('d').str[0].astype(int)
    data['M'] = data.groupby('billing_email')['order_total'].transform('sum')
 
    dailydate = data.drop_duplicates(subset=['billing_email', 'ymd'])
    dailydate['F'] = dailydate.groupby('billing_email')['ymd'].transform('count')
    
    return dailydate

In [8]:
def RepPeriod(data):
    repurchase = data.query('F > 1')
    repurchase = repurchase.sort_values(by=['billing_email', 'ymd'])
    repurchase['lastymd'] = repurchase.groupby('billing_email')['ymd'].shift().fillna(repurchase['ymd'])
    repurchase['repurchase_period'] = pd.to_datetime(repurchase['ymd']) - pd.to_datetime(repurchase['lastymd'])
    repurchase['repurchase_period'] = repurchase['repurchase_period'].astype('str').str.split('d').str[0].astype(int)
    
    RepPeriod = repurchase.query('repurchase_period > 0')
    return RepPeriod['repurchase_period'].mean() * 3

In [9]:
def GetNAPL(data):
    data['Frequent'] = data['F'].apply(FreqType)
    data['napl'] = data.apply(lambda x: Grouped(x['R'], x['F']), axis=1)
    money = data.groupby(['napl'])['M'].sum()
    people = data.groupby(['napl'])['billing_email'].count()
    return (data, money, people)

In [10]:
def FreqType(x):
    if x == 1:
        return '1'
    if x == 2:
        return '2'
    if x > 2:
        return '3 up'

In [11]:
def Grouped(x, y):
    if y > 1:
        if x > 169:
            return 'potential'
        else:
            return 'active'
    else:
        if x > 169:
            return 'lost'
        else:
            return 'new'

In [126]:
data2 = GetRFM(before_2)
data3 = GetRFM(before_3)
data4 = GetRFM(before_4)
data5 = GetRFM(before_5)
data6 = GetRFM(before_6)

In [33]:
rep_mean = RepPeriod(data3)
print(int(rep_mean))

169

In [127]:
data2_unique = data2.drop_duplicates(subset='billing_email')
data3_unique = data3.drop_duplicates(subset='billing_email')
data4_unique = data4.drop_duplicates(subset='billing_email')
data5_unique = data5.drop_duplicates(subset='billing_email')
data6_unique = data6.drop_duplicates(subset='billing_email')

In [157]:
data2, money2, people2 = GetNAPL(data2_unique)
data3, money3, people3 = GetNAPL(data3_unique)
data4, money4, people4 = GetNAPL(data4_unique)
data5, money5, people5 = GetNAPL(data5_unique)
data6, money6, people6 = GetNAPL(data6_unique)

In [159]:
ymd = pd.Series(np.zeros(money2.shape[0]), name='ymd')
df = money2.to_frame().join(ymd).join(people2).reset_index()
df['ymd'] = '2016-02'
df['M_percentage'] = df['M'] / df['M'].sum() * 100
df['N_percentage'] = df['billing_email'] / df['billing_email'].sum() * 100
df

        napl        M      ymd  billing_email  M_percentage  N_percentage
0     active  9710486  2016-02           1150     49.521052     22.209347
1       lost  1417314  2016-02            666      7.227947     12.862109
2        new  7568428  2016-02           3219     38.597091     62.166860
3  potential   912576  2016-02            143      4.653910      2.761684

In [167]:
tempdf = money6.to_frame().join(ymd).join(people6).reset_index()
tempdf['ymd'] = '2016-06'
tempdf['M_percentage'] = tempdf['M'] / tempdf['M'].sum() * 100
tempdf['N_percentage'] = tempdf['billing_email'] / tempdf['billing_email'].sum() * 100
tempdf

        napl         M      ymd  billing_email  M_percentage  N_percentage
0     active  23907603  2016-06           2336     54.304388     23.264615
1       lost   4718568  2016-06           2101     10.717885     20.924211
2        new  12334822  2016-06           5173     28.017655     51.518773
3  potential   3064184  2016-06            431      6.960072      4.292401

In [168]:
df = pd.concat([df, tempdf], axis=0)
df

        napl         M      ymd  billing_email  M_percentage  N_percentage
0     active   9710486  2016-02           1150     49.521052     22.209347
1       lost   1417314  2016-02            666      7.227947     12.862109
2        new   7568428  2016-02           3219     38.597091     62.166860
3  potential    912576  2016-02            143      4.653910      2.761684
0     active  13070547  2016-03           1518     49.435377     22.415830
1       lost   2168870  2016-03            816      8.203092     12.049616
2        new  10030950  2016-03           4265     37.939024     62.979917
3  potential   1169296  2016-03            173      4.422507      2.554637
0     active  17079146  2016-04           1839     53.186615     23.399924
1       lost   2332333  2016-04            914      7.263179     11.629978
2        new  11417292  2016-04           4913     35.554888     62.514315
3  potential   1282966  2016-04            193      3.995318      2.455783
0     active  22191641  2016-05           2218     56.048328     24.606168
1       lost   2948761  2016-05           1376      7.447540     15.265143
2        new  12747666  2016-05           5161     32.196148     57.255381
3  potential   1705693  2016-05            259      4.307984      2.873308
0     active  23907603  2016-06           2336     54.304388     23.264615
1       lost   4718568  2016-06           2101     10.717885     20.924211
2        new  12334822  2016-06           5173     28.017655     51.518773
3  potential   3064184  2016-06            431      6.960072      4.292401

In [169]:
df.to_csv('trytry.csv')